Revit 2024 API
ViewSchedule.TitleTextTypeId Property
 Defines the default text style used in the header section of the schedule.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2014
Syntax
C#
public ElementId TitleTextTypeId { get; set; }
Visual Basic
Public Property TitleTextTypeId As ElementId
	Get
	Set
Visual C++
public:
property ElementId^ TitleTextTypeId {
	ElementId^ get ();
	void set (ElementId^ value);
}
Remarks
 Cells may override the default style.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  When setting this property: The text type id doesn't represent a valid text type element.
Autodesk.Revit.Exceptions.ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
ViewSchedule Class
Autodesk.Revit.DB Namespace